# AntaresOS · Brewfile — brew bundle --file=Brewfile

# Core
brew "stow"
brew "starship"
brew "zellij"
brew "neovim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Navigation
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "lazygit"
brew "jq"
brew "tldr"
brew "navi"

# Daily / DevX
brew "atuin"      # histórico de shell turbinado (Ctrl-R)
brew "direnv"     # env por diretório (.envrc)
brew "mise"       # versões de linguagens por projeto
brew "btop"       # monitor de sistema
brew "fastfetch"  # info da máquina

# Toolchain
brew "awscli"
brew "bash"
brew "gh"
brew "gradle"
brew "newsboat"
brew "poppler"
brew "python@3.11"
brew "trivy"

# Languages / scratch (rodar blocos de código)
tap "clojure/tools"
brew "clojure/tools/clojure"   # Clojure CLI (clj)
brew "kotlin"                  # kotlinc / REPL
brew "rust"                    # cargo — necessário p/ compilar o sniprun no macOS

# Mobile / Flutter
cask "flutter"

# Apps
cask "ghostty"
cask "font-fira-code-nerd-font"
cask "010-editor"
cask "ngrok"
